Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཁུ་བྱུག་ནེ་ཙོ་རི་སྐེགས་སྒྲ་རྣམས་དང་། །ཁྲུང་ཁྲུང་རྨ་བྱ་མིའམ་ཅི་ཡི་སྒྲ།
en: “The songs of cuckoos, parrots, and mynas, Of cranes, peacocks, and kinnaras—

source: །སྒྲ་དབྱངས་ཡིད་འོང་སྙན་པ་ཅི་ཡོད་པ།
en: All these beautiful, melodious sounds

source: །སྙན་ཅིང་མཉེན་ལ་ཡིད་འོང་དགའ་བ་དང་། །ཤིན་ཏུ་མཉེན་ལ་རབ་བསྔགས་ཞི་བའི་ཚིག །དབྱངས་རྣམས་ཐམས་ཅད་དུས་གཅིག་བསྒྲགས་པ་བས།
en: “Delightful, melodious, beautiful, enjoyable, Exquisite, peaceful voices singing praises— All such voices singing simultaneously

source: །དེ་བཞིན་གཤེགས་པའི་གསུང་མཆོག་དགར་འགྱུར་ཡིན།
en: Are not as delightful as the Tathāgata’s perfect speech. {31}

source: །ལྷ་མི་མི་དབང་ལྷ་མ་ཡིན་རྣམས་དང་། །སྲིད་གསུམ་སེམས་ཅན་མཐའ་དག་ཅི་ཡོད་པ། །འོད་བྱེད་རྣམས་ཀྱི་འོད་སྣང་དེ་དག་ནི།
en: “The light from all luminous beings, From devas, humans, kings, and asuras, And from all beings in the three existences,

source: །བདེ་གཤེགས་འོད་ཟེར་གཅིག་གི་ཟིལ་གྱིས་ནོན།
en: Are eclipsed by one light ray from the Sugata. {32}

source: །བདེ་གཤེགས་སྐུ་ནི་མེ་ཏོག་རྒྱས་པ་བཞིན།
en: “The Sugata’s body is like a blossomed flower

source: །མཚན་རྣམས་ཀུན་གྱིས་སྣ་ཚོགས་སྤྲས་ཤིང་བརྒྱན།
en: With the various adornments of all the special signs.

source: །བསོད་ནམས་བརྒྱས་གྲུབ་དག་ཅིང་རྣམ་པར་དང་། །རྒྱལ་བའི་སྐུ་ནི་འཇིག་རྟེན་ཀུན་ཏུ་ལྷན།
en: A pure and clear accomplishment of hundreds of merits, The body of the Jina shines on the entire world. {33}

source: །དུང་གི་སྒྲ་དང་འཁར་རྔ་སྒྲ་སྙན་དང་། །རྔའི་སྒྲ་དེ་བཞིན་ཀིམ་པ་ལ་ཡི་སྒྲ།
en: “The sound of conches and of paṇavas, And the sound of bherī drums and kimpalas—

source: །རབ་ཏུ་འཇམ་ཞིང་འཐད་པའི་སྒྲ་དེ་ཀུན།
en: All those beautiful and delightful sounds

source: །སངས་རྒྱས་དབྱངས་ཀྱི་བརྒྱ་ཡི་ཆར་མི་ཕོད།
en: Cannot equal a hundredth of the Buddha’s voice. {34}

source: །སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་གི་སྒྲ།
en: “The sounds of quintillions of musical instruments,

source: །སྒྲ་སྐད་གསལ་ཞིང་མཉེན་པ་ལྷ་ཡི་འདྲ།
en: Clear and beautiful voices like those of the devas,

source: །ལྷ་དང་ལྷ་མོའི་སྒྲ་དབྱངས་དགར་འགྱུར་བ།
en: And the delightful voices of male and female devas

source: །ཁྲུང་ཁྲུང་རྨ་བྱ་ངུར་པ་ཁུ་བྱུག་དང་། །ངང་པ་ཀུ་ནལ་རྣམ་མང་བྱ་ཡི་ཚོགས།
en: “Flocks of a multitude of birds—cranes, peacocks, Shelducks, cuckoos, geese, and snipe—

source: །དེ་དག་སྒྲ་སྙན་དུས་གཅིག་ཚོགས་པས་ཀྱང་།
en: May simultaneously sing their songs, but they

source: །ཀླུ་དང་གནོད་སྦྱིན་ལྷ་མིན་ལྟོ་འཕྱེ་དང་། །ལྷ་དབང་ཚངས་པ་ལྷ་ཡི་བདག་པོའི་སྒྲ།
en: “The voices of nāgas, yakṣas, asuras, mahoragas, Devendra, Brahmā, and the lords of the devas—

source: །སྲིད་གསུམ་ཡིད་འོང་འཐད་པ་ཅི་ཡོད་པ།
en: All the lovely and beautiful voices in the three existences

source: །དེ་དག་སངས་རྒྱས་དབྱངས་ཀྱི་ཆར་མི་ཕོད།
en: Cannot equal a hundredth of the Buddha’s voice. {37}

source: །ཚངས་པའི་འོད་དང་ལྷ་ཡི་དབང་པོ་དང་། །ཉི་མ་དང་ནི་ནོར་བུ་རིན་ཆེན་འོད།
en: “The light of Brahmā and lords of the devas, The light of the sun and precious jewels,

source: །ཀུན་གྱི་འོད་ནི་རྣམ་པ་དུ་མ་དག །འོད་ཀུན་རྒྱལ་བའི་འོད་ཀྱིས་ཟིལ་གྱིས་ནོན།
en: The many different kinds of light— All those lights are eclipsed by the brilliance of the Jina’s light. {38}

source: །ལུས་དང་ངག་དང་ཡིད་ཀྱང་ཤིན་ཏུ་རྣམ་པར་དག །ཡེ་ཤེས་དག་པ་སྲིད་པ་གསུམ་ན་གོས་པ་མེད།
en: “Your body, speech, and mind are perfectly pure. The purity of your wisdom is unstained by the three existences.

source: །མི་དབང་ཡོན་ཏན་དབྱིག་ཚོགས་ཡོན་ཏན་རིན་ཆེན་མངའ།
en: Lord of men, you have the wealth of qualities, precious qualities.

source: །རང་འབྱུང་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ནི་མཉམ་མེད་མཉམ།
en: Self-arisen one, through all your qualities, you are without equal.” {39}

source: །དེ་ལྟར་སྟོབས་བཅུ་བདེན་པ་གསུང་ལ་བསྟོད་ནས་ནི། །གཞོན་ནུ་ཡིད་ཀྱང་རབ་ཏུ་དགའ་བས་ཚིག་སྨྲས་པ།
en: In that way the youth spoke those words with great joy, Praising the one with ten strengths, the speaker of truth.

source: །སངས་རྒྱས་གཞལ་མེད་དཔག་ཡས་ལ་ནི་མཆོད་པ་ཡིས།
en: He said, “By offering to the measureless, unquantifiable Buddha

source: །ཤཱཀྱ་ཐུབ་བཞིན་བདག་ཀྱང་སངས་རྒྱས་གྱུར་ཅིག་སྨྲ།
en: May I also become a buddha like Śākyamuni!” {40}

source: །བདེ་བར་གཤེགས་པས་དེ་ཡི་སྤྱོད་པ་མཆོག་མཁྱེན་ནས།
en: Knowing his perfect conduct, the Sugata,

source: །མི་དབང་ཆགས་མེད་ཡེ་ཤེས་མངའ་བ་འཛུམ་པ་མཛད།
en: The Lord of humans, the one with wisdom free of attachment, smiled.

source: །སྟོབས་བཅུ་སྲས་ཀྱི་ཐུ་བོ་བྱམས་པས་དེ་ཞུས་ཏེ།
en: Maitreya, the senior son of the one with ten strengths, asked him,

source: །འདྲེན་པས་གང་གི་སླད་དུ་འདི་ལྟར་འཛུམ་པ་མཛད།
en: “For what reason did the Guide smile? {41}

source: །ས་འདི་དག་ཀྱང་རྣམ་པ་དྲུག་ཏུ་ཡོངས་སུ་གཡོས།
en: “The earth has shaken in six ways.

source: །ལྷ་དང་ཀླུ་རྣམས་མཁའ་ལ་འདུག་ཅིང་རབ་དགའ་སྟེ།
en: The devas and nāgas in the sky are filled with joy.

source: །ཤིན་ཏུ་སེམས་རངས་མགུ་བས་སངས་རྒྱས་ལྟ་ཞིང་མཆིས།
en: They are gazing at the Buddha with great delight and happiness.

source: །བདེ་གཤེགས་ཟིལ་གྱིས་མ་ནོན་དེ་དག་ལུང་བསྟན་གསོལ།
en: I pray to the unconquerable Sugata that you elucidate this to them. {42}

source: །སྐྱེས་བུ་མཆོག་གི་ཡེ་ཤེས་གང་ལ་ཞུགས་པ་ནི།
en: “You have a supreme being’s wisdom,

source: །བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་དག་གི་ས་མ་ལགས།
en: Which is not the level of the Bhagavān’s śrāvakas.

source: །རྒྱལ་བ་ཁྱོད་ཀྱིས་གང་གི་སླད་དུ་འཛུམ་མཛད་པ། །ཡེ་ཤེས་རྣམ་དག་དཔེ་མེད་ཡེ་ཤེས་མ་ལུས་གསུངས།
en: You who have pure wisdom beyond examples, wise one, Tell us the entire reason, Jina, why you smiled. {43}

source: །ཤཱཀྱའི་སེང་གེ་སྟོབས་བཅུ་མངའ་ཞིང་རྣམ་འདྲེན་པ།
en: “You are the Śākya lion, possessor of the ten strengths, the Guide,

source: །རྐང་གཉིས་གཙོ་བོ་ཡེ་ཤེས་ཀྱི་ཡང་ཕ་རོལ་ཕྱིན།
en: The chief of humans, the one who has reached the perfection of wisdom.

source: །འདོད་ཆགས་དང་ནི་ཞེ་སྡང་ཐ་བ་གཏི་མུག་སེལ།
en: You have eliminated intractable desire, anger, and ignorance.

source: །རབ་ཏུ་འོད་སྣང་མཛད་པ་ཁྱོད་ལ་ཞུ་བ་ལགས།
en: To you who shine with intense light, I ask this question: {44}

source: །བྱང་ཆུབ་དམ་པ་མཆོག་འདི་རབ་ཏུ་ཚོལ་བའི་ཕྱིར།
en: “Seeking the supreme, highest enlightenment,

source: །འདྲེན་པ་ཁྱོད་ཀྱིས་བསྐལ་པ་གང་གཱའི་བྱེ་སྙེད་དང་། །དེ་ལས་ལྷག་པར་ཡང་ནི་སྤྱོད་པ་རབ་ཏུ་སྤྱད།
en: You, the Guide, practiced for millions of eons As numerous as the grains of sand in the Ganges.

source: །གང་གི་དོན་དུ་འཛུམ་པ་འདི་མཛད་བསྟན་དུ་གསོལ།
en: For what reason did you show a smile? {45}

source: །ཡེ་ཤེས་དམ་པ་མཆོག་འདི་རབ་ཏུ་ཚོལ་བའི་ཕྱིར།
en: “Seeking the supreme, highest enlightenment,

source: །སྟོན་པས་ཕྱག་དང་ཞབས་ཀྱང་ཡོངས་སུ་བཏང་བ་མཛད།
en: You, the Teacher, gave away your arms and legs.

source: །སྲས་དང་བཙུན་མོ་གཉེན་བཤེས་རྩ་ལག་ཕངས་པ་བཏང་།
en: You gave away sons, wives, companions, and relations.

source: །ཐུབ་པ་འཛུམ་པ་བསྟན་པ་འདི་ཡི་རྒྱུ་གང་ལགས།
en: Sage, for what reason did you show a smile? {46}

source: །རྟ་དང་བ་གླང་དང་ནི་ཤིང་རྟ་རྐང་ཐང་དང་། །བྲན་དང་ནོར་བུ་དངུལ་དང་མུ་ཏིག་ཁྱོད་ཀྱིས་བཏང་།
en: “You gave away horses, elephants, and chariots, Slaves, jewels, silver, and pearls.

source: །སྤྱོད་པ་མཆོག་སྤྱོད་ཚེ་ནི་ཁྱོད་ཀྱིས་མ་བཏང་བ། །རིན་པོ་ཆེ་དང་ནོར་རྫས་དག་ནི་གང་ཡང་མེད།
en: When you practiced the sublime conduct There were no jewels or wealth that you did not give away. {47}

source: །སྲིད་པ་གསུམ་ན་ཡེ་ཤེས་དག་ནི་མཆོག་ཏུ་གྱུར།
en: “You have the supreme wisdom in the three existences.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན།
en: You know the conduct of all beings.

source: །སེམས་དང་ཁམས་དང་མོས་པ་དག་ལའང་མཁས་ཤིང་རིག །གང་གི་དོན་དུ་འཛུམ་པ་འདི་དག་བསྟན་པ་མཛད།
en: You are skilled in knowing their natures, minds, and aspirations. For what reason did you smile? {48}

source: །མི་ཡི་གཙོ་བོ་ལ་ནི་གང་གིས་མཆོད།
en: “Who made the offering to you, best of men?

source: །གང་གི་དོན་ནི་རྒྱ་ཆེ་ཡངས་པར་འགྱུར།
en: For whom has vast merit been created?

source: །སྤྱོད་པ་འདི་ཡང་སུ་དག་རབ་ཏུ་འཛིན།
en: Who has gained that excellent conduct?

source: །ཐུབ་པ་གང་གི་དོན་དུ་འཛུམ་འདི་བསྟན།
en: Sage, for what reason did you smile? {49}

source: །པད་མ་བྱེ་བ་འདབ་མ་བྱེ་བར་ལྡན།
en: They shine and have millions of excellent petals.

source: །གསེར་གྱི་པད་མ་ཤིན་ཏུ་འོད་གསལ་བ། །མཛེས་ཤིང་ཡིད་དུ་འཐད་པ་ས་ལས་བྱུང་། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་རབ་ཆེ་བ།
en: They are the color of gold, beautiful and delightful. {50}

source: །རྒྱལ་བའི་ཐུགས་ཀྱི་སྲས་པོ་དེ་ལ་མཆིས།
en: “Present here are the heart sons of the Jina Who show the greatest bodhisattva miracles.

source: །ཆོས་སྨྲ་བ་ཡང་མང་པོ་འདིར་མཆིས་ཏེ།
en: Many dharmabhāṇakas have gathered here.

source: །འདྲེན་པ་ལ་ནི་དེ་ཡི་སླད་དུ་ཞུ།
en: Guide, I ask my question for their sake. {51}

source: །རྔ་དང་དུང་དང་འཁར་རྔ་སྒྲ་ཆེན་དང་། །སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྡུངས་པ་ཡི།
en: “The sound of bherī drums, conches, and gongs, Of quintillions of instruments has resounded.

source: །དེ་དག་སྒྲ་ནི་ནམ་མཁའ་འདི་ལས་གདའ།
en: That music was heard coming from the sky,

source: །བདེ་བར་གཤེགས་པའི་དབྱངས་ནི་བསམ་མི་ཁྱབ།
en: But compared to that the Sugata’s speech is inconceivable. {52}

source: །ཁྲུང་ཁྲུང་ངང་པ་ཀ་ལ་པིང་ཀ་དང་། །ཁུ་བྱུག་བྱ་ཚོགས་མང་པོ་འདུས་པ་ཡི།
en: “Many flocks of birds have gathered, Cranes, geese, avadavats, and cuckoos.

source: །སྒྲ་དབྱངས་རབ་ཏུ་སྙན་པ་ཕྱུང་བ་ཡང་།
en: They have sung their perfect, beautiful songs,

source: །གང་གིས་སྦྱིན་དང་དུལ་དང་ལེགས་སྡོམ་རྣམས།
en: “Who in the past with generosity, self-restraint, and self-control

source: །སྔོན་གྱི་བསྐལ་པ་མང་པོར་བསྙེན་པར་བགྱིས།
en: Has served well for many millions of eons?

source: །གང་གིས་མི་ཡི་གཙོ་བོ་རབ་མཆོད་ན།
en: Who has made offerings to you, supreme among men?

source: །སུ་ཡི་སླད་དུ་འཛུམ་པ་འདི་དག་བསྟན།
en: For what reason did you smile? {54} “Who in the past, having shown you the greatest veneration,

source: །རི་མོ་གུས་པ་མཆོག་ཀྱང་བསྐྱེད་ནས་ནི།
en: Asked you, supreme among men, the question,

source: །སངས་རྒྱས་བྱང་ཆུབ་ཇི་ལྟར་ཐོབ་འགྱུར་ཞེས། །གང་གིས་རྐང་གཉིས་གཙོ་ལ་སྔོན་ཆད་ཞུས།
en: ‘How can I attain the enlightenment of buddhahood?’

source: །སྟོབས་བཅུ་ལྡན་པ་ཇི་སྙེད་འདས་པ་དང་། །ད་ལྟར་བྱུང་དང་མ་བྱོན་བདེ་གཤེགས་དང་། །མི་ཡི་གཙོ་བོ་ཐམས་ཅད་རབ་ཏུ་མཁྱེན།
en: “Those with the ten strengths in the past, The sugatas of the present and the future, And you, supreme among men, know all.

source: །དེ་ཕྱིར་སྐྱེ་དགུའི་དོན་དུ་ཞུ་བ་ལགས།
en: Therefore for the benefit of beings I ask this question. {56} “You know the thoughts in the minds of beings

source: །སྲོག་ཆགས་ཀུན་གྱི་སྤྱོད་ཡུལ་མཐའ་ཡས་དང་། །མི་རྣམས་གང་གི་བསམ་པ་ཇི་འདྲ་དང་། །སྐྱེ་དགུའི་སེམས་ཀྱི་རྒྱུད་ཀྱང་རབ་ཏུ་མཁྱེན། །དེ་ཕྱིར་མི་ཡི་གཙོ་ལ་ཞུ་བ་ལགས།
en: And all beings’ infinite ways of conduct; You know the aspirations that humans have. Therefore I ask this question to you, supreme among men. {57} “Those who are practicing the supreme conduct,

source: །རྒྱུ་དང་རིགས་པ་འདུལ་ལ་མཁས་པ་དག །སངས་རྒྱས་ཡེ་ཤེས་ཇི་ལྟར་ཐོབ་སྙམ་པ། །སྤྱོད་པ་མཆོག་ལ་སུ་དག་སྤྱོད་པ་རྣམས། །དེ་ཕྱིར་བདག་ནི་རྐང་གཉིས་གཙོ་ལ་ཞུ།
en: Who are adept in causes, reasons, and discipline, They ask, ‘How does one attain the Buddha’s wisdom?’ Therefore, supreme human, I ask this question. {58} “There are those who meditate on the field of experience of those with the ten strengths:

source: །གང་གིས་ཕྲ་ཞིང་ཤིན་ཏུ་བལྟ་དཀའི་ཆོས།
en: The subtle Dharma that is difficult to perceive,

source: །སྟོང་པ་ཞི་བ་མཚུངས་མེད་བསམ་མི་ཁྱབ། །སྟོབས་བཅུ་ལྡན་པའི་སྤྱོད་ཡུལ་བསྒོམས་པ་རྣམས།
en: And emptiness and peace that is unequaled and inconceivable.

source: །དེ་དག་སླད་དུ་འདྲེན་པ་བདག་ཞུའོ། །སྲོག་ཆགས་འགྲོ་བ་བསམ་ཡས་ཀུན་གྱི་ཕྱིར།
en: For their sake, Guide, I ask you this question. {59}

source: །གང་གིས་བྱམས་པ་སྙིང་རྗེ་རབ་བསྒོམས་ཤིང་།
en: “Those who meditate on love and compassion For all the countless beings in the world,

source: །གང་ལ་སེམས་ཅན་འདུ་ཤེས་མེད་པ་དག །དེ་ཕྱིར་རྐང་གཉིས་གཙོ་ལ་བདག་ཞུའོ།
en: Without their having the concept of beings— Supreme human, for their sake I ask this question. {60}

source: །གང་དག་ཡེ་ཤེས་མཚུངས་མེད་བསམ་མི་ཁྱབ།
en: “Those who have inconceivable, unequaled wisdom,

source: །དེ་དག་ལ་ནི་གཟུང་བ་ཡོང་མེད་དེ།
en: They are never known to have any grasping.

source: །སེམས་དང་སྤྱོད་ཡུལ་དག་གི་ཕ་རོལ་ཕྱིན།
en: They have reached the perfection of the mind’s field of activity.

source: །དེ་ཕྱིར་མགོན་པོ་ལ་ནི་བདག་ཞུའོ།
en: Lord, it is for their sake that I ask this question. {61}

source: །ཚུལ་ཁྲིམས་ཡེ་ཤེས་ཡོན་ཏན་ཕ་རོལ་ཕྱིན།
en: “You have reached the perfection of conduct and wisdom’s qualities.

source: །དུས་གསུམ་ལ་ནི་ཡེ་ཤེས་མཚུངས་མེད་འཇུག །ཁྱོད་ལ་འཁྲུལ་པ་དག་ནི་མི་མངའ་ན།
en: You have unequaled knowledge of the three times. You will never make an error.

source: །ཤཱ་རིའི་བུ་དང་མ་འགགས་མཽད་གལ་བུ།
en: “Śāriputra, Aniruddha, and Kolita,

source: །བདེ་གཤེགས་ཉན་ཐོས་གཞན་གང་སུ་མཆིས་པ།
en: And the other śrāvakas of the Sugata,

source: །འདི་ལ་དེ་དག་ཡེ་ཤེས་མི་འཇུག་སྟེ།
en: Do not have that wisdom.

source: །འདི་ནི་སངས་རྒྱས་སྤྱོད་ཡུལ་བླ་ན་མེད།
en: It is the unsurpassable field of activity of the buddhas. {63}

source: །ཆོས་རྣམས་ཀུན་ལ་དབང་བའི་ཕ་རོལ་ཕྱིན།
en: “You have reached the perfection of power over all phenomena.

source: །བསླབས་པའི་སྤྱོད་པ་ཀུན་གྱིས་མངོན་པར་འཕགས།
en: You have ascended through the practice of the training.

source: །འདྲེན་པ་ཐུགས་རྗེ་དག་ཀྱང་རབ་བསྐྱེད་ལ།
en: Guide, you have developed compassion.

source: །དོན་དམ་མཁྱེན་པ་གསུང་སྒྲ་དབྱུང་བར་གསོལ།
en: You who know the ultimate truth, release your voice! {64}

source: །སྔོན་གང་བསྐལ་པ་བྱེ་བ་མང་པོར་ཡང་།
en: “You have had, in the past for many millions of eons,

source: །སྐྱབས་དང་དཔུང་གཉེན་མཆོག་ཏུ་གྱུར་སྙམ་སྟེ།
en: The goal of being the ultimate refuge and protector,

source: །དེ་འདྲའི་སེམས་ཀྱིས་རྐང་གཉིས་གཙོ་དྲིས་པ།
en: And have inquired, supreme human, with just that intention;

source: །འདྲེན་པས་དེ་ཡི་འབྲས་བུ་དེང་གསུང་ཤིག །གང་ཟག་ཆེན་པོས་ལུང་བསྟན་མཉན་པའི་ཕྱིར།
en: Guide, tell us the result of that today. {65}

source: །གནོད་སྦྱིན་སྲིན་པོ་གྲུལ་བུམ་གསང་བ་པོ།
en: “Yakṣas, rākṣasas, kumbhāṇḍas, and guhyakas

source: །རྐང་གཉིས་གཙོ་བོ་ལ་ནི་རབ་རྟོག་ཅིང་།
en: Are gazing upon the supreme among humans.

source: །ཐམས་ཅད་ཐལ་མོ་སྦྱར་ཏེ་གུས་པར་འཁོད།
en: They are all respectful, their palms together in homage,

source: །སངས་རྒྱས་ཞིང་ནི་བྱེ་བ་མང་པོ་ནས།
en: In order to listen to the elucidation from the great being. {66}

source: །བྱང་ཆུབ་སེམས་དཔའ་འཕྲུལ་ལྡན་མང་པོ་མཆིས།
en: “Many bodhisattvas with miraculous powers Have come from millions of buddha realms.

source: །བདེ་གཤེགས་སྲས་ཀྱི་གཙོ་བོ་ཐུགས་ལས་སྐྱེས།
en: These senior sons, born form the minds of the sugatas,

source: །ཐམས་ཅད་ཐལ་མོ་སྦྱར་ཅིང་གུས་པས་འཁོད། །ཤཱཀྱ་སེང་གེ་མི་མཆོག་དྲི་བའི་ཕྱིར།
en: Are all respectfully present, their palms together in homage. {67}

source: །མི་འཁྲུགས་ཞིང་ཕྱོགས་འཇིག་རྟེན་རྣམ་གྲགས་པ།
en: “Gandhahasti with millions of bodhisattvas

source: །ཤར་ཕྱོགས་ནས་ནི་སྤོས་ཀྱི་གླང་པོ་ཡང་།
en: Has come into your presence from the east,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་མདུན་བདར་མཆིས།
en: From the famous world of Akṣobhya’s realm

source: །ཤཱཀྱ་སེང་གེ་མི་མཆོག་དྲི་བའི་ཕྱིར། །བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་ཁམས་མཆོག་ནས།
en: For this question, Lion of the Śākyas, supreme human. {68}

source: །མཐུ་ཆེན་ཐོབ་དང་སྤྱན་རས་གཟིགས་དབང་ཡང་། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ལྷན་ཅིག་མཆིས།
en: “Avalokiteśvara and Mahā­sthāma­prāpta Have come before you with millions of bodhisattvas From the supreme realm of Sukhāvatī For this question, Lion of the Śākyas, supreme human. {69}

source: །གང་དག་སྔན་ཆད་བསྐལ་པ་བྱེ་མང་སྙེད།
en: “In the past for many millions of eons

source: །ཡེ་ཤེས་དམ་པ་མཆོག་འདི་ཚོལ་བའི་ཕྱིར།
en: They have served countless sugatas

source: །རྒྱ་མཚོ་ཀུན་གྱི་བྱེ་མ་མཉམ་པ་ཡི།
en: As numerous as the sand grains in all the oceans, Seeking this supreme sublime wisdom. {70}

source: །བདེ་གཤེགས་དཔག་ཏུ་མེད་པ་བསྙེན་བཀུར་བགྱིས།
en: “Mañjughoṣa is present, his palms together in homage.

source: །སངས་རྒྱས་ཀུན་གྱིས་བསྟོད་ཅིང་རབ་བསྔགས་པ།
en: He has been praised and extolled by all the buddhas.

source: །ཆོས་རྣམས་ཀུན་གྱི་ཡོན་ཏན་ཕ་རོལ་ཕྱིན།
en: He has reached the perfection of all good qualities

source: །འཇིག་རྟེན་ཕྱོགས་རྣམས་ཀུན་ཏུ་རབ་གྲགས་པ། །འཇམ་དབྱངས་ལེགས་པར་ཐལ་མོ་སྦྱར་ཏེ་མཆིས།
en: And is renowned throughout the worlds in all directions. {71}

source: །སངས་རྒྱས་ཞིང་དུ་ཁྲག་ཁྲིག་སྤྱད་བགྱིས་ཀྱང་།
en: “They have practiced in millions of buddha realms.

source: །འདི་འདྲ་རྣམས་ནི་མཐོང་བ་རྙེད་དཀའ་སྟེ།
en: It is very rare to see such beings.

source: །ལེགས་བསླབས་སངས་རྒྱས་སྲས་པོ་ཡོན་ཏན་ཅན། །ཐམས་ཅད་ཐལ་མོ་རབ་སྦྱར་གུས་པར་འཁོད།
en: They have the qualities of sons of the buddhas and excellent training, And are all present, with their palms together respectfully in homage. {72} “There is no one here other than worthy recipients. That is what these wise ones are like,

source: །སྟོན་པ་ཀུན་གྱི་ཆོས་ཀྱི་མཛོད་འཛིན་པ། །མཁས་པ་འདིར་མཆིས་ཅི་འདྲ་དེ་ལྟ་བུ། །སྣོད་དུ་གྱུར་པ་འདི་ན་གཞན་མ་མཆིས།
en: The holders of the Dharma treasures of all teachers.

source: །འདྲེན་པ་འཇམ་པའི་དབྱངས་སུ་བརྗོད་པ་གསུངས།
en: Guide, release your gentle speech. {73}

source: །རྒྱལ་བ་རྣམ་འདྲེན་གླེང་གཞི་མ་མཆིས་པར། །གང་ཟག་དམ་པ་འཛུམ་པ་མི་སྟོན་ན།
en: “The jinas, the guides, the supreme humans Have never been seen to smile without a reason. Grant us your supreme speech, which is like the beat of a drum.

source: །གང་གི་སླད་དུ་འཛུམ་པ་འདི་བསྟན་པ།
en: What is the reason that we saw you smile? {74}

source: །རྔ་མཆོག་སྒྲ་ལྡན་གསུང་དབྱངས་དབྱུང་དུ་གསོལ།
en: “The supreme beings resound like thunder,

source: །ངང་པ་ཁུ་བྱུག་རྨ་བྱ་ས་ར་ས། །འབྲུག་གི་སྒྲ་སྐད་ཁྱུ་མཆོག་སྒྲ་འབྱིན་བཞིན།
en: Geese, cuckoos, peacocks, and swans,

source: །ལྷ་ཡི་རོལ་མོ་སྙན་པའི་སྒྲ་འབྱིན་པ།
en: And they emit the melodious music of the devas.

source: །སེམས་ཅན་གྲོལ་མཛད་གསུང་གིས་ལུང་སྟོན་ཅིག །བྱམས་པ་སྐྱེད་ཅིང་དགའ་བ་འཕེལ་བར་བགྱིད།
en: Liberator of beings, elucidate with your words. {75} “You develop kindness, you increase joy,

source: །ཡེ་ཤེས་སྟོན་ཅིང་མ་རིག་སེལ་བ་སྟེ།
en: You teach wisdom, you eliminate ignorance,

source: །དོན་ལ་རྟོག་ཅིང་ཤེས་རབ་འཕེལ་བགྱིད་ཅིང་།
en: You realize the meaning, you expand wisdom,

source: །བསྐལ་པ་ཁྲག་ཁྲིག་བྱེ་བར་རྣམ་སྦྱོང་བ།
en: And you have purified for quintillions of eons. {76}

source: །རྟོགས་པས་ངེས་བགྱིས་དངོས་པོ་རྣམ་པར་བཤིག །སྡུག་བསྔལ་འགོག་པའི་ཚིག་དོན་ངེས་པར་སྟོན།
en: “You have realized the nature of things with certainty, You have taught the meaning in words that end suffering.

source: །མུ་སྟེགས་ཀུན་གྱི་སྨྲ་བ་རྣམ་པར་འཇོམས།
en: You have routed the teachings of all tīrthikas.

source: །སྟོང་པ་སྲོག་མེད་སེམས་ཅན་མེད་པ་སྒོམ།
en: You meditate on emptiness, the absence of being, and the absence of a soul. {77}

source: །བསོད་ནམས་སྟོང་ཕྲག་བརྒྱ་ཡིས་ལེགས་པར་བརྒྱན།
en: “You are adorned by thousands of merits.

source: །སངས་རྒྱས་སྟོང་ཕྲག་བརྒྱ་ཡིས་འདིར་སྤྱད་དེ།
en: You have practiced with hundreds of thousands of buddhas,

source: །ལྷ་རྣམས་སྟོང་ཕྲག་བརྒྱ་ཡིས་རབ་ཏུ་བསྟོད།
en: Are praised by hundreds of thousands of devas,

source: །ཚངས་པ་སྟོང་ཕྲག་བརྒྱ་ཡིས་ཕྱག་ཀྱང་བགྱིས།
en: And hundreds of thousands of Brahmās pay homage to you. {78}

source: །གནོད་སྦྱིན་སྲིན་པོ་གྲུལ་བུམ་དད་བགྱིད་དེ།
en: “Yakṣas, rākṣasas, and kumbhāṇḍas have faith in you.

source: །ཀླུ་དང་ལྟོ་འཕྱེ་འདབ་བཟངས་གྲོལ་བར་བགྱིད།
en: You have liberated nāgas, mahoragas, and garuḍas.

source: །རྟག་ཏུ་མ་ཆགས་ཤིན་ཏུ་ལྡན་པ་སྟེ།
en: You are constantly without any attachment.

source: །ལས་དགེའི་འབྲས་བུས་འཕགས་པ་གསུང་ཕྱུང་ཤིག །རྒྱལ་བ་ཇི་སྙེད་མྱ་ངན་འདས་པ་དང་། །གང་དག་མ་བྱོན་པ་དང་བཞུགས་པ་རྣམས།
en: Speak the words that are the result of good actions. {79} “All the jinas that have passed into nirvāṇa, Those who will live in the future, and those now present,

source: །ཐམས་ཅད་ཁྱོད་ཀྱིས་མཁྱེན་ཅིང་ཐོགས་མི་མངའ།
en: You know them all without impediment.

source: །འདྲེན་པ་ཡོན་ཏན་ཀུན་གྱིས་ཤིན་ཏུ་འཕགས།
en: Guide, you are sublime because of all your qualities. {80} “This earth that supports beings, with its mountains

source: །འབྱུང་པོ་འཛིན་པ་རི་དང་རྒྱ་མཚོར་བཅས། །ས་འདི་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: And oceans, has been shaken in six ways.

source: །ལྷ་ཡི་ཚོགས་རྣམས་མཁའ་ལས་མེ་ཏོག་འཐོར།
en: The devas have thrown down flowers from the sky.

source: །ལྷ་ཡི་སྤོས་ངད་ཡིད་དུ་འོང་བ་ལྡང་།
en: There has arisen the beautiful aroma of the incense of the devas. {81}

source: །འདོད་ཆགས་ཞེ་སྡང་རབ་རིབ་མ་ལུས་བསལ།
en: “Desire, anger, and darkness of the mind have been completely eliminated.

source: །ཚུལ་ཁྲིམས་ཡོངས་དག་ཡིད་ཀྱང་ཡོངས་སུ་དག །མཚན་མེད་རབ་ཏུ་ཞི་བའི་སྟོང་ལ་དགྱེས།
en: Conduct has become completely pure and the mind has become completely pure. There is delight in complete peace, emptiness, and the absence of attributes.

source: །སེང་གེའི་སྒྲ་སྐད་སྒྲོགས་ཤིག་ཐུགས་རྗེ་ཅན།
en: There is the sound of the lion’s roar, the sound of the compassionate ones. {82}

source: །སྤོབས་དང་ལྡན་ཞིང་ཤིན་ཏུ་སྙན་པ་ཡངས།
en: “You have the confidence of speech, and great renown.

source: །རྒྱལ་བའི་ཤེས་རབ་རྫོགས་ཤིང་ཡེ་ཤེས་རྫོགས།
en: You have perfected wisdom, the wisdom of the jinas.

source: །ཐུགས་རྗེ་ལྡན་པ་ཁྱོད་འདྲ་འཇིག་རྟེན་མེད།
en: Compassionate one, there is no one like you in this world.

source: །གང་གི་དོན་དུ་འཛུམ་པ་འདི་བསྟན་གསུངས།
en: Tell us, for what reason did you smile? {83}

source: །རྨ་བྱ་ཁུ་བྱུག་ཀ་ལ་པིང་ཀའི་སྒྲ།
en: “The songs of peacocks, cuckoos, and avadavats,

source: །ཤང་ཤང་ཏེའུའི་སྒྲ་ཡང་ཡིད་འོང་བ།
en: And likewise the beautiful song of the partridge,

source: །དགའ་འགྱུར་སྐད་ཀུན་དུས་གཅིག་ཚོགས་པས་ཀྱང་།
en: All those pleasant sounds simultaneously

source: །བདེ་གཤེགས་གསུང་གི་ཆར་ནི་དེས་མི་ཕོད།
en: Do not equal a fraction of the Sugata’s speech. {84}

source: །རྔ་དང་རྫ་རྔ་འཁར་རྔ་དེ་བཞིན་ཏེ།
en: “Bherī drums, mṛdaṅgas, and similarly paṇavas;

source: །དུང་དང་གླིང་བུ་དེ་བཞིན་པི་བང་དང་། །སིལ་སྙན་སྟོང་གི་སྒྲ་རྣམས་གཅིག་ཏུ་འདུས།
en: Conches, flutes, and similarly lutes: The simultaneous sound of a thousand instruments

source: །དེ་དག་བདེ་གཤེགས་སྒྲ་ཡི་ཆར་མི་ཕོད།
en: Does not equal a fraction of the Sugata’s speech. {85}

source: །ལྷ་ཡི་སིལ་སྙན་དམ་པ་སྟོང་གི་སྒྲ།
en: “The divine, sublime sound of thousands of instruments

source: །ལྷ་ཡི་བུ་མོ་གླུ་དབྱངས་སྙན་པ་དང་། །རོལ་མོའི་སྒྲ་རྣམས་དགའ་བ་སྐྱེད་བགྱིད་པ།
en: And the beautiful songs of deva maidens, The excellent songs that bring delightful sounds to the mind,

source: །དེ་དག་བདེ་གཤེགས་གསུང་གི་ཆར་མི་ཕོད།
en: Do not equal a fraction of the Sugata’s speech. {86}

source: །འཇིག་རྟེན་ཕན་པ་ཁྱོད་ཀྱི་གསུང་གཅིག་ལས། །མོས་པ་ཐ་དད་བཞིན་དུ་སྒྲ་འབྱུང་སྟེ།
en: “With one sound you benefit the world As it resounds to those with different aspirations,

source: །རྒྱལ་བ་བདག་ལ་སྟོན་སྙམ་སོ་སོ་སེམས།
en: Each person thinking, ‘The Jina is speaking to me.’

source: །གང་གི་སླད་དུ་ཁྱོད་ཀྱིས་འཛུམ་མཛད་བསྟན།
en: For what reason did you smile? {87}

source: །ལྷ་ཡི་སྒྲ་དང་དེ་བཞིན་ཀླུ་ཡི་སྐད།
en: “The music of the devas and the music of the nāgas,

source: །མི་འམ་ཅི་ཡི་སྒྲ་སྙན་ཅི་མཆིས་པ།
en: And also the melodious music of the kinnaras,

source: །དེ་དག་ནམ་ཡང་ཉོན་མོངས་ཞི་མི་བགྱིད།
en: Are never able to pacify the kleśas.

source: །སངས་རྒྱས་གསུང་ནི་རྟག་ཏུ་ཉོན་མོངས་སེལ།
en: The Buddha’s speech always dispels the kleśas. {88}

source: །དགའ་བ་སྐྱེད་ཅིང་འདོད་ཆགས་དགའ་མ་ལགས།
en: “You create joy but not joy in desire.

source: །བྱམས་པ་སྐྱེད་ཅིང་ཞེ་སྡང་བློ་མ་ལགས།
en: You create love and not a mind of anger.

source: །ཤེས་རབ་སྐྱེད་ཅིང་གཏི་མུག་བློ་མ་ལགས།
en: You create wisdom and not a mind of stupidity.

source: །སངས་རྒྱས་གསུང་གིས་དྲི་མ་ཐམས་ཅད་སེལ།
en: The Buddha’s speech eliminates all stains. {89}

source: །འཁོར་ལས་སླད་རོལ་ཏུ་ནི་སྒྲ་མི་འབྱུང་།
en: “The sound of your voice does not go beyond your followers.

source: །ཐམས་ཅད་ཀྱི་ཡང་ནེམ་ནུར་བརྒྱ་མང་གཅོད།
en: It cuts through everyone’s hundreds of doubts.

source: །མཐོ་བ་མ་ལགས་དམའ་བ་མ་ལགས་པ།
en: It is never too quiet nor too loud.

source: །ཐུབ་པའི་གསུང་ནི་སྙོམས་ཤིང་བདེ་བ་སྟོན།
en: The Sage’s voice teaches everyone equally and easily. {90}

source: །རི་དང་ནགས་བཅས་ས་འདི་གས་གྱུར་ཅིང་།
en: “This earth with its mountains and forests may perish,

source: །རྒྱ་མཚོའི་ཆུ་དག་དེ་བཞིན་གས་གྱུར་ལ།
en: And so may the waters of the ocean.

source: །ཟླ་བ་ཉི་མ་ས་ལ་ལྷུང་གྱུར་ཀྱང་།
en: The moon and the sun may fall to the earth,

source: །རྒྱལ་བས་བཤད་པ་རྣམ་པ་གཞན་མི་འགྱུར།
en: But the Jina’s speech will never change. {91}

source: །ཚིག་གི་ཡན་ལག་ཐམས་ཅད་དག་པའི་གསུང་།
en: “Your voice has all the qualities of pure speech.

source: །སེང་གེའི་སྒྲ་སྐད་འཇམ་ཞིང་མཉེན་པའི་དབྱངས།
en: Your beautiful voice is a gentle lion’s roar.
